/*
    Compile unit: C:\users\tsuji\title\src\Dr_MARIO\gc\src\aidata.c
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x00055F98 -> 0x00055F98
*/
struct {
    // total size: 0x38
    signed short dt_LnOnLinVrs; // offset 0x0, size 0x2
    signed short dt_LnEraseVrs; // offset 0x2, size 0x2
    signed short dt_EraseLinP1; // offset 0x4, size 0x2
    signed short dt_EraseLinP3; // offset 0x6, size 0x2
    signed short dt_HeiEraseLinRate; // offset 0x8, size 0x2
    signed short dt_WidEraseLinRate; // offset 0xA, size 0x2
    signed short dt_P_ALN_HeightP; // offset 0xC, size 0x2
    signed short dt_P_ALN_FallCap; // offset 0xE, size 0x2
    signed short dt_P_ALN_FallVrs; // offset 0x10, size 0x2
    signed short dt_P_ALN_Capsule; // offset 0x12, size 0x2
    signed short dt_P_ALN_Virus; // offset 0x14, size 0x2
    signed short dt_WP_ALN_Bottom; // offset 0x16, size 0x2
    signed short dt_WP_ALN_FallCap; // offset 0x18, size 0x2
    signed short dt_WP_ALN_FallVrs; // offset 0x1A, size 0x2
    signed short dt_WP_ALN_Capsule; // offset 0x1C, size 0x2
    signed short dt_WP_ALN_Virus; // offset 0x1E, size 0x2
    signed short dt_OnVirusP; // offset 0x20, size 0x2
    signed short dt_RensaP; // offset 0x22, size 0x2
    signed short dt_RensaMP; // offset 0x24, size 0x2
    signed short dt_LnHighCaps; // offset 0x26, size 0x2
    signed short dt_LnHighVrs; // offset 0x28, size 0x2
    signed short dt_aiWall_F; // offset 0x2A, size 0x2
    signed short dt_HeiLinesAllp2; // offset 0x2C, size 0x2
    signed short dt_HeiLinesAllp3; // offset 0x2E, size 0x2
    signed short dt_HeiLinesAllp4; // offset 0x30, size 0x2
    signed short dt_WidLinesAllp2; // offset 0x32, size 0x2
    signed short dt_WidLinesAllp3; // offset 0x34, size 0x2
    signed short dt_WidLinesAllp4; // offset 0x36, size 0x2
} ai_param_org[6][8]; // size: 0xA80, address: 0x23728
struct {
    // total size: 0x6C
    signed char wait_attack; // offset 0x0, size 0x1
    signed char speed; // offset 0x1, size 0x1
    signed short luck; // offset 0x2, size 0x2
    signed char logic[8]; // offset 0x4, size 0x8
    signed char condition[16]; // offset 0xC, size 0x10
    signed short condition_param[16]; // offset 0x1C, size 0x20
    signed char effect[16]; // offset 0x3C, size 0x10
    signed short effect_param[16]; // offset 0x4C, size 0x20
} ai_char_data_org[16]; // size: 0x6C0, address: 0x241A8
struct {
    // total size: 0x6C
    signed char wait_attack; // offset 0x0, size 0x1
    signed char speed; // offset 0x1, size 0x1
    signed short luck; // offset 0x2, size 0x2
    signed char logic[8]; // offset 0x4, size 0x8
    signed char condition[16]; // offset 0xC, size 0x10
    signed short condition_param[16]; // offset 0x1C, size 0x20
    signed char effect[16]; // offset 0x3C, size 0x10
    signed short effect_param[16]; // offset 0x4C, size 0x20
} ai_char_data[16]; // size: 0x6C0, address: 0x57260
struct {
    // total size: 0x38
    signed short dt_LnOnLinVrs; // offset 0x0, size 0x2
    signed short dt_LnEraseVrs; // offset 0x2, size 0x2
    signed short dt_EraseLinP1; // offset 0x4, size 0x2
    signed short dt_EraseLinP3; // offset 0x6, size 0x2
    signed short dt_HeiEraseLinRate; // offset 0x8, size 0x2
    signed short dt_WidEraseLinRate; // offset 0xA, size 0x2
    signed short dt_P_ALN_HeightP; // offset 0xC, size 0x2
    signed short dt_P_ALN_FallCap; // offset 0xE, size 0x2
    signed short dt_P_ALN_FallVrs; // offset 0x10, size 0x2
    signed short dt_P_ALN_Capsule; // offset 0x12, size 0x2
    signed short dt_P_ALN_Virus; // offset 0x14, size 0x2
    signed short dt_WP_ALN_Bottom; // offset 0x16, size 0x2
    signed short dt_WP_ALN_FallCap; // offset 0x18, size 0x2
    signed short dt_WP_ALN_FallVrs; // offset 0x1A, size 0x2
    signed short dt_WP_ALN_Capsule; // offset 0x1C, size 0x2
    signed short dt_WP_ALN_Virus; // offset 0x1E, size 0x2
    signed short dt_OnVirusP; // offset 0x20, size 0x2
    signed short dt_RensaP; // offset 0x22, size 0x2
    signed short dt_RensaMP; // offset 0x24, size 0x2
    signed short dt_LnHighCaps; // offset 0x26, size 0x2
    signed short dt_LnHighVrs; // offset 0x28, size 0x2
    signed short dt_aiWall_F; // offset 0x2A, size 0x2
    signed short dt_HeiLinesAllp2; // offset 0x2C, size 0x2
    signed short dt_HeiLinesAllp3; // offset 0x2E, size 0x2
    signed short dt_HeiLinesAllp4; // offset 0x30, size 0x2
    signed short dt_WidLinesAllp2; // offset 0x32, size 0x2
    signed short dt_WidLinesAllp3; // offset 0x34, size 0x2
    signed short dt_WidLinesAllp4; // offset 0x36, size 0x2
} ai_param[6][8]; // size: 0xA80, address: 0x57920

