/*
    Compile unit: C:\users\tsuji\title\src\Dr_MARIO\gc\src\dm_game_main.c
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x0000D9C8 -> 0x00021E08
*/
unsigned char virus_anime_table[3][4]; // size: 0xC, address: 0x48F0
unsigned char Score1p[][6]; // size: 0x0, address: 0x48D8
@enum$99dm_game_main_c;
struct SAnimeSeq {
    // total size: 0x1C
    unsigned char labelStack[4]; // offset 0x0, size 0x4
    unsigned char countStack[4]; // offset 0x4, size 0x4
    int stackDepth; // offset 0x8, size 0x4
    unsigned char * * seqArray; // offset 0xC, size 0x4
    int animeNo; // offset 0x10, size 0x4
    int seqCount; // offset 0x14, size 0x4
    int textureNo; // offset 0x18, size 0x4
};
struct SAnimeState {
    // total size: 0x40
    struct SAnimeSeq animeSeq[1]; // offset 0x0, size 0x1C
    struct_tex_func_c_1287 * texArray; // offset 0x1C, size 0x4
    unsigned long frameCount; // offset 0x20, size 0x4
    int center[2]; // offset 0x24, size 0x8
    int charNo; // offset 0x2C, size 0x4
    int color[4]; // offset 0x30, size 0x10
};
unsigned long evs_high_score; // size: 0x4, address: 0x18F98
signed char evs_story_flg; // size: 0x1, address: 0x18F91
signed char evs_story_level; // size: 0x1, address: 0x4880
@enum$106dm_title_main_c;
@enum$106dm_title_main_c evs_gamesel; // size: 0x4, address: 0x190B8
// Range: 0xD9C8 -> 0xDAD8
unsigned long dm_make_score(struct_dm_game_main_c_176 * state /* r1+0x0 */) {
    // Local variables
    int level; // r5

    // References
    // -> unsigned long evs_high_score;
    // -> unsigned char Score1p[][6];
    // -> @enum$106dm_title_main_c evs_gamesel;
    // -> signed char evs_story_level;
    // -> signed char evs_story_flg;
}

static signed char dm_chaine_se_table_vs$178[2]; // size: 0x2, address: 0x4918
static signed char dm_chaine_se_table_4p$179[4][3]; // size: 0xC, address: 0x491C
// Range: 0xDAD8 -> 0xDBC0
void dm_attack_se(struct_dm_game_main_c_176 * state /* r28 */, int player_no /* r1+0xC */) {
    // Local variables
    int i; // r29

    // References
    // -> static signed char dm_chaine_se_table_4p$179[4][3];
    // -> static signed char dm_chaine_se_table_vs$178[2];
    // -> @enum$106dm_title_main_c evs_gamesel;
}

// Range: 0xDBC0 -> 0xDC60
void dm_warning_h_line(struct_dm_game_main_c_176 * state /* r27 */, struct_dm_game_main_c_487 * map /* r28 */) {
    // Local variables
    int i; // r31
    int j; // r30
    int flg; // r29
}

// Range: 0xDC60 -> 0xDF5C
static int set_down_flg(struct_dm_game_main_c_487 * map /* r27 */) {
    // Local variables
    int i; // r1+0x8
    int j; // r28
    int ret; // r3
    unsigned int k; // r1+0x8
    unsigned int l; // r20
    unsigned int flg[2]; // r1+0x24
}

// Range: 0xDF5C -> 0xE1D4
void go_down(struct_dm_game_main_c_176 * state /* r30 */, struct_dm_game_main_c_487 * map /* r31 */, int cout /* r1+0x10 */) {
    // Local variables
    int i; // r25
    int j; // r24
    unsigned int k; // r1+0x8
    unsigned int se_flg; // r4
}

// Range: 0xE1D4 -> 0xE2A8
void erase_anime(struct_dm_game_main_c_487 * map /* r29 */) {
    // Local variables
    int i; // r30
}

static int rotate_table$399[4]; // size: 0x10, address: 0xB38
static int rotate_mtx$400[6]; // size: 0x18, address: 0xB48
// Range: 0xE2A8 -> 0xE37C
static void throw_rotate_capsel(struct_dm_game_main_c_690 * cap /* r1+0x0 */) {
    // Local variables
    int vec; // r8
    int save; // r4

    // References
    // -> static int rotate_mtx$400[6];
    // -> static int rotate_table$399[4];
}

// Range: 0xE37C -> 0xE5A4
void translate_capsel(struct_dm_game_main_c_487 * map /* r26 */, struct_dm_game_main_c_176 * state /* r27 */, int move_vec /* r28 */, int joy_no /* r29 */) {
    // Local variables
    int vec; // r31
    struct_dm_game_main_c_690 * cap; // r30
}

static unsigned int rotate_table$474[4]; // size: 0x10, address: 0x4928
static unsigned int rotate_mtx$475[6]; // size: 0x18, address: 0x4938
// Range: 0xE5A4 -> 0xE7C8
void rotate_capsel(struct_dm_game_main_c_487 * map /* r27 */, struct_dm_game_main_c_690 * cap /* r28 */, int move_vec /* r29 */) {
    // Local variables
    int vec; // r30
    unsigned int save; // r3

    // References
    // -> static unsigned int rotate_mtx$475[6];
    // -> static unsigned int rotate_table$474[4];
}

unsigned char CapsMagazine[]; // size: 0x0, address: 0x18F9C
// Range: 0xE7C8 -> 0xE8F4
static void dm_make_magazine() {
    // Local variables
    int i; // r26
    int tmp; // r1+0x8

    // References
    // -> unsigned char CapsMagazine[];
}

// Range: 0xE8F4 -> 0xE940
static void dm_init_capsel(struct_dm_game_main_c_690 * cap /* r1+0x0 */, unsigned int left_cap_col /* r1+0x4 */, unsigned int right_cap_col /* r1+0x8 */) {}

// Range: 0xE940 -> 0xEA90
void dm_set_capsel(struct_dm_game_main_c_176 * state /* r1+0x0 */) {
    // References
    // -> unsigned char CapsMagazine[];
}

static unsigned char _speed$561[3]; // size: 0x3, address: 0xB60
unsigned char GameSpeed[]; // size: 0x0, address: 0x489C
@enum$107dm_title_main_c;
@enum$107dm_title_main_c evs_gamemode; // size: 0x4, address: 0x190B4
// Range: 0xEA90 -> 0xEB44
void dm_capsel_speed_up(struct_dm_game_main_c_176 * state /* r31 */) {
    // References
    // -> static unsigned char _speed$561[3];
    // -> @enum$107dm_title_main_c evs_gamemode;
    // -> unsigned char GameSpeed[];
}

// Range: 0xEB44 -> 0xEB60
int dm_check_game_over(struct_dm_game_main_c_176 * state /* r1+0x0 */) {}

@enum$110dm_title_main_c;
// Range: 0xEB60 -> 0xEBE4
static int update_flash_virus_count(struct_dm_game_main_c_176 * state /* r3 */, struct_dm_game_main_c_487 * map /* r1+0x4 */, @enum$110dm_title_main_c flag /* r1+0x8 */) {
    // Local variables
    int count; // r8
    int i; // r9
    int j; // r1+0x0
}

// Range: 0xEBE4 -> 0xED2C
static void dm_set_virus(struct_dm_game_main_c_176 * state /* r28 */, struct_dm_game_main_c_487 * map /* r29 */, struct_dm_game_main_c_1653 * v_map /* r30 */, unsigned char * order /* r27 */) {
    // Local variables
    unsigned int p; // r27
    int virus_max; // r1+0x8

    // References
    // -> @enum$107dm_title_main_c evs_gamemode;
    // -> unsigned char virus_anime_table[3][4];
}

// Range: 0xED2C -> 0xEEC4
void dm_virus_anime(struct_dm_game_main_c_176 * state /* r1+0x0 */, struct_dm_game_main_c_487 * map /* r4 */) {
    // Local variables
    int i; // r7

    // References
    // -> unsigned char virus_anime_table[3][4];
}

// Range: 0xEEC4 -> 0xEF58
void dm_capsel_erase_anime(struct_dm_game_main_c_176 * state /* r30 */, struct_dm_game_main_c_487 * map /* r31 */) {}

// Range: 0xEF58 -> 0xEFFC
static void dm_make_erase_h_line(struct_dm_game_main_c_176 * state /* r1+0x0 */, struct_dm_game_main_c_487 * map /* r1+0x4 */, int start /* r5 */, int chain /* r1+0xC */, int pos_x /* r1+0x10 */) {
    // Local variables
    int i; // r1+0x0
}

// Range: 0xEFFC -> 0xF158
int dm_h_erase_chack(struct_dm_game_main_c_487 * map /* r1+0x0 */) {
    // Local variables
    int i; // r6
    int j; // r7
    int chain; // r8
    int chain_start; // r1+0x0
    int chain_col; // r9
}

// Range: 0xF158 -> 0xF360
void dm_h_erase_chack_set(struct_dm_game_main_c_176 * state /* r23 */, struct_dm_game_main_c_487 * map /* r24 */) {
    // Local variables
    int i; // r30
    int j; // r29
    int end; // r28
    int chain; // r27
    int chain_start; // r26
    int chain_col; // r25
}

// Range: 0xF360 -> 0xF404
static void dm_make_erase_w_line(struct_dm_game_main_c_176 * state /* r1+0x0 */, struct_dm_game_main_c_487 * map /* r1+0x4 */, unsigned int start /* r5 */, unsigned int chain /* r1+0xC */, unsigned int pos_y /* r1+0x10 */) {
    // Local variables
    int i; // r5
    int p; // r1+0x0
}

// Range: 0xF404 -> 0xF568
int dm_w_erase_chack(struct_dm_game_main_c_487 * map /* r1+0x0 */) {
    // Local variables
    int i; // r7
    int j; // r8
    int chain; // r9
    int chain_start; // r1+0x0
    int chain_col; // r10
}

// Range: 0xF568 -> 0xF770
void dm_w_erase_chack_set(struct_dm_game_main_c_176 * state /* r22 */, struct_dm_game_main_c_487 * map /* r23 */) {
    // Local variables
    unsigned int p; // r1+0x8
    unsigned int end; // r29
    int i; // r28
    int j; // r27
    int chain; // r26
    int chain_start; // r25
    int chain_col; // r24
}

// Range: 0xF770 -> 0xF8F0
void dm_h_ball_chack(struct_dm_game_main_c_487 * map /* r1+0x0 */) {
    // Local variables
    unsigned int i; // r5
    unsigned int j; // r6
}

// Range: 0xF8F0 -> 0xF9EC
void dm_w_ball_chack(struct_dm_game_main_c_487 * map /* r1+0x0 */) {
    // Local variables
    unsigned int i; // r9
    unsigned int j; // r10
}

// Range: 0xF9EC -> 0xFA9C
int dm_black_up(struct_dm_game_main_c_176 * state /* r1+0x0 */, struct_dm_game_main_c_487 * map /* r1+0x4 */) {
    // Local variables
    unsigned char i; // r6
}

// Range: 0xFA9C -> 0xFCC0
int dm_broken_set(struct_dm_game_main_c_176 * state /* r31 */, struct_dm_game_main_c_487 * map /* r27 */) {
    // Local variables
    unsigned int i; // r29
    unsigned int j; // r28
    unsigned int chack; // r1+0x8
    unsigned short work[16][2]; // r1+0x20
    int ret; // r3
}

// Range: 0xFCC0 -> 0xFE60
static void dm_calc_erase_score_pos(struct_dm_game_main_c_176 * state /* r1+0x8 */, struct_dm_game_main_c_487 * map /* r1+0xC */, int * pos /* r1+0x10 */) {
    // Local variables
    int count; // r6
    int x; // r12
    int y; // r31
    struct_dm_game_main_c_487 * mp; // r1+0x8
}

unsigned char FlyingCnt[]; // size: 0x0, address: 0x488C
// Range: 0xFE60 -> 0x10330
static int dm_calc_capsel_pos(struct_dm_game_main_c_176 * state /* r25 */, int * xx /* r26 */, int * yy /* r27 */) {
    // Local variables
    struct_dm_game_main_c_690 * n_cap; // r29
    float aa; // f7
    float bb; // f6
    float ee; // f1
    float ff; // f30
    float ii; // f3
    int gg; // r1+0x8
    int hh; // r28

    // References
    // -> unsigned char FlyingCnt[];
}

union_drmario_gc_c_202 * gp; // size: 0x4, address: 0x1E9A4
union_drmario_gc_c_202 normal_texture_init_dl[]; // size: 0x0, address: 0x4208
// Range: 0x10330 -> 0x10454
static void dm_draw_capsel_by_gfx(struct_dm_game_main_c_176 * state /* r31 */, int * xx /* r29 */, int * yy /* r28 */) {
    // Local variables
    struct_dm_game_main_c_690 * cap; // r27
    struct_tex_func_c_1287 * tex; // r1+0x8
    struct_tex_func_c_1287 * pal; // r1+0x8
    int i; // r26
    int type; // r25
    union_drmario_gc_c_202 * _g; // r1+0x8
    union_drmario_gc_c_202 * _g; // r1+0x8

    // References
    // -> union [anonymous] * gp;
    // -> union [anonymous] normal_texture_init_dl[];
}

// Range: 0x10454 -> 0x10578
static void dm_draw_capsel_by_cpu_tentative(struct_dm_game_main_c_176 * state /* r31 */, int * xx /* r29 */, int * yy /* r28 */) {
    // Local variables
    struct_dm_game_main_c_690 * cap; // r27
    struct_tex_func_c_1287 * tex; // r1+0x8
    struct_tex_func_c_1287 * pal; // r1+0x8
    int i; // r26
    int type; // r25
    union_drmario_gc_c_202 * _g; // r1+0x8
    union_drmario_gc_c_202 * _g; // r1+0x8

    // References
    // -> union [anonymous] * gp;
    // -> union [anonymous] normal_texture_init_dl[];
}

static void * heapTop; // size: 0x4, address: 0x1A1A0
int dm_think_flg; // size: 0x4, address: 0x1A1A4
static int visible_fall_point[4]; // size: 0x10, address: 0x4950
static unsigned char _retryMenu_itemCount[6]; // size: 0x6, address: 0xB88
static float _big_virus_def_wait[3]; // size: 0xC, address: 0xB90
static float _big_virus_min_wait[3]; // size: 0xC, address: 0xB9C
static float _big_virus_max_wait[3]; // size: 0xC, address: 0xBA8
static unsigned char _scoreNumsColor[6][3]; // size: 0x12, address: 0xBB4
static char _mesPassword[22]; // size: 0x16, address: 0x4960
static char _mesEasyCont[112]; // size: 0x70, address: 0x4978
static char _mesEasyNoCont[152]; // size: 0x98, address: 0x49E8
static char _mesNormalCont[114]; // size: 0x72, address: 0x4A80
static char _mesNormalNoCont[152]; // size: 0x98, address: 0x4AF4
static char _mesHardCont[112]; // size: 0x70, address: 0x4B8C
static char _mesHardNoCont[324]; // size: 0x144, address: 0x4BFC
static char _mesSHardCont[114]; // size: 0x72, address: 0x4D40
static char _mesSHardNoCont[178]; // size: 0xB2, address: 0x4DB4
static char _mesWriting[71]; // size: 0x47, address: 0xBC8
static int _posStP4StarX[4]; // size: 0x10, address: 0xC10
static int _posStStar[2][2]; // size: 0x10, address: 0xC20
static int _posLsTime[2]; // size: 0x8, address: 0xC30
static int _posP2StarX[2]; // size: 0x8, address: 0xC38
static int _posP2StarY[3][3]; // size: 0x24, address: 0xC40
static int _posP4Bottle[4][2]; // size: 0x20, address: 0xC64
static int _posP4BottleIn[2]; // size: 0x8, address: 0xC84
static int _posP4CharBase[4][2]; // size: 0x20, address: 0xC8C
static int _posP4TeamStarX[3][2][3]; // size: 0x48, address: 0xCAC
static int _posP4CharStarX[3][4][3]; // size: 0x90, address: 0xCF4
static int _posP4StockCap[2][2]; // size: 0x10, address: 0xD84
static int _posP2VirusNum[2][2]; // size: 0x10, address: 0xD94
static int _posP2CharFrm[2][2]; // size: 0x10, address: 0xDA4
// Range: 0x10578 -> 0x10584
void * dm_game_heap_top() {
    // References
    // -> static void * heapTop;
}

struct SAnimeSmog {
    // total size: 0x124
    struct SAnimeState animeState[4]; // offset 0x0, size 0x100
    int pos[4][2]; // offset 0x100, size 0x20
    int frameCount; // offset 0x120, size 0x4
};
struct_dm_game_main_c_4937 * watchGame; // size: 0x4, address: 0x1A1A8
// Range: 0x10584 -> 0x1059C
struct SAnimeState * get_virus_anime_state(int index /* r1+0x0 */) {
    // References
    // -> struct [anonymous] * watchGame;
}

// Range: 0x1059C -> 0x105B4
struct SAnimeSmog * get_virus_smog_state(int index /* r1+0x0 */) {
    // References
    // -> struct [anonymous] * watchGame;
}

struct_dm_game_main_c_4974 * gameGeom; // size: 0x4, address: 0x1A1AC
unsigned long gfx_gtask_no; // size: 0x4, address: 0x1E9A0
// Range: 0x105B4 -> 0x105D4
union_main_story_c_778 * dm_get_mtx_buf() {
    // References
    // -> unsigned long gfx_gtask_no;
    // -> struct [anonymous] * gameGeom;
}

// Range: 0x105D4 -> 0x105F8
union_tex_func_c_1051 * dm_get_vtx_buf() {
    // References
    // -> unsigned long gfx_gtask_no;
    // -> struct [anonymous] * gameGeom;
}

unsigned char evs_playcnt; // size: 0x1, address: 0x487A
