/*
    Compile unit: C:\users\tsuji\title\src\Dr_MARIO\gc\src\unzip.c
    Producer: MW EABI PPC C-Compiler
    Language: C++
    Code range: 0x0000999C -> 0x00009DBC
*/
union {
    struct {
        // total size: 0x8
        unsigned int w0; // offset 0x0, size 0x4
        unsigned int w1; // offset 0x4, size 0x4
    } words; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int par : 8; // offset 0x0, size 0x4
        unsigned int len : 16; // offset 0x0, size 0x4
        unsigned int addr; // offset 0x4, size 0x4
    } dma; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad : 24; // offset 0x0, size 0x4
        struct {
            // total size: 0x4
            unsigned char flag; // offset 0x0, size 0x1
            unsigned char v[3]; // offset 0x1, size 0x3
        } tri; // offset 0x4, size 0x4
    } tri; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad : 24; // offset 0x0, size 0x4
        struct {
            // total size: 0x4
            unsigned char flag; // offset 0x0, size 0x1
            unsigned char v[3]; // offset 0x1, size 0x3
        } line; // offset 0x4, size 0x4
    } line; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad1 : 24; // offset 0x0, size 0x4
        int pad2 : 24; // offset 0x4, size 0x4
        unsigned int param : 8; // offset 0x4, size 0x4
    } popmtx; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad0 : 8; // offset 0x0, size 0x4
        int mw_index : 8; // offset 0x0, size 0x4
        int number : 8; // offset 0x0, size 0x4
        int pad1 : 8; // offset 0x4, size 0x4
        int base : 24; // offset 0x4, size 0x4
    } segment; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad0 : 8; // offset 0x0, size 0x4
        int sft : 8; // offset 0x0, size 0x4
        int len : 8; // offset 0x0, size 0x4
        unsigned int data : 32; // offset 0x4, size 0x4
    } setothermodeH; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad0 : 8; // offset 0x0, size 0x4
        int sft : 8; // offset 0x0, size 0x4
        int len : 8; // offset 0x0, size 0x4
        unsigned int data : 32; // offset 0x4, size 0x4
    } setothermodeL; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        unsigned char cmd; // offset 0x0, size 0x1
        unsigned char lodscale; // offset 0x1, size 0x1
        unsigned char tile; // offset 0x2, size 0x1
        unsigned char on; // offset 0x3, size 0x1
        unsigned short s; // offset 0x4, size 0x2
        unsigned short t; // offset 0x6, size 0x2
    } texture; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int pad1 : 24; // offset 0x0, size 0x4
        signed short pad2; // offset 0x4, size 0x2
        signed short scale; // offset 0x6, size 0x2
    } perspnorm; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int fmt : 3; // offset 0x0, size 0x4
        unsigned int siz : 2; // offset 0x0, size 0x4
        unsigned int pad : 7; // offset 0x0, size 0x4
        unsigned int wd : 12; // offset 0x0, size 0x4
        unsigned int dram; // offset 0x4, size 0x4
    } setimg; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int muxs0 : 24; // offset 0x0, size 0x4
        unsigned int muxs1 : 32; // offset 0x4, size 0x4
    } setcombine; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned char pad; // offset 0x1, size 0x1
        unsigned char prim_min_level; // offset 0x2, size 0x1
        unsigned char prim_level; // offset 0x3, size 0x1
        unsigned long color; // offset 0x4, size 0x4
    } setcolor; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        int x0 : 10; // offset 0x0, size 0x4
        int x0frac : 2; // offset 0x0, size 0x4
        int y0 : 10; // offset 0x0, size 0x4
        int y0frac : 2; // offset 0x0, size 0x4
        unsigned int pad : 8; // offset 0x4, size 0x4
        int x1 : 10; // offset 0x4, size 0x4
        int x1frac : 2; // offset 0x4, size 0x4
        int y1 : 10; // offset 0x4, size 0x4
        int y1frac : 2; // offset 0x4, size 0x4
    } fillrect; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int fmt : 3; // offset 0x0, size 0x4
        unsigned int siz : 2; // offset 0x0, size 0x4
        unsigned int pad0 : 1; // offset 0x0, size 0x4
        unsigned int line : 9; // offset 0x0, size 0x4
        unsigned int tmem : 9; // offset 0x0, size 0x4
        unsigned int pad1 : 5; // offset 0x4, size 0x4
        unsigned int tile : 3; // offset 0x4, size 0x4
        unsigned int palette : 4; // offset 0x4, size 0x4
        unsigned int ct : 1; // offset 0x4, size 0x4
        unsigned int mt : 1; // offset 0x4, size 0x4
        unsigned int maskt : 4; // offset 0x4, size 0x4
        unsigned int shiftt : 4; // offset 0x4, size 0x4
        unsigned int cs : 1; // offset 0x4, size 0x4
        unsigned int ms : 1; // offset 0x4, size 0x4
        unsigned int masks : 4; // offset 0x4, size 0x4
        unsigned int shifts : 4; // offset 0x4, size 0x4
    } settile; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int sl : 12; // offset 0x0, size 0x4
        unsigned int tl : 12; // offset 0x0, size 0x4
        int pad : 5; // offset 0x4, size 0x4
        unsigned int tile : 3; // offset 0x4, size 0x4
        unsigned int sh : 12; // offset 0x4, size 0x4
        unsigned int th : 12; // offset 0x4, size 0x4
    } loadtile; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int sl : 12; // offset 0x0, size 0x4
        unsigned int tl : 12; // offset 0x0, size 0x4
        int pad : 5; // offset 0x4, size 0x4
        unsigned int tile : 3; // offset 0x4, size 0x4
        unsigned int sh : 12; // offset 0x4, size 0x4
        unsigned int th : 12; // offset 0x4, size 0x4
    } settilesize; // offset 0x0, size 0x8
    struct {
        // total size: 0x8
        int cmd : 8; // offset 0x0, size 0x4
        unsigned int sl : 12; // offset 0x0, size 0x4
        unsigned int tl : 12; // offset 0x0, size 0x4
        int pad : 5; // offset 0x4, size 0x4
        unsigned int tile : 3; // offset 0x4, size 0x4
        unsigned int sh : 12; // offset 0x4, size 0x4
        unsigned int th : 12; // offset 0x4, size 0x4
    } loadtlut; // offset 0x0, size 0x8
    long long force_structure_alignment; // offset 0x0, size 0x8
} gzip_dummy_dl[1]; // size: 0x8, address: 0x42A0
static unsigned long crc_32_tab[256]; // size: 0x400, address: 0x42A8
struct {
    // total size: 0x8
    unsigned long next_addr; // offset 0x0, size 0x4
    unsigned long rest_size; // offset 0x4, size 0x4
} ifd; // size: 0x8, address: 0x8E10
struct {
    // total size: 0x8
    unsigned long next_addr; // offset 0x0, size 0x4
    unsigned long rest_size; // offset 0x4, size 0x4
} ofd; // size: 0x8, address: 0x8E18
// Range: 0x999C -> 0x99E8
unsigned long expand_gzip(char * src_addr /* r1+0x8 */, char * dst_addr /* r1+0xC */, unsigned long size /* r1+0x10 */) {
    // References
    // -> struct [anonymous] ofd;
    // -> struct [anonymous] ifd;
}

// Range: 0x99E8 -> 0x9AA8
unsigned long data_write(struct {
    // total size: 0x8
    unsigned long next_addr; // offset 0x0, size 0x4
    unsigned long rest_size; // offset 0x4, size 0x4
} * outfile /* r1+0x0 */, unsigned char * src_addr /* r1+0x4 */, unsigned int size /* r5 */) {
    // Local variables
    unsigned long i; // r7
    unsigned char * dst_addr; // r8
}

unsigned int inptr; // size: 0x4, address: 0x8E20
unsigned int insize; // size: 0x4, address: 0x8E24
unsigned char inbuf[8192]; // size: 0x2000, address: 0x8E28
// Range: 0x9AA8 -> 0x9B60
int unzip() {
    // Local variables
    int res; // r1+0x8
    int n; // r29
    unsigned char buf[32]; // r1+0x8

    // References
    // -> unsigned int inptr;
    // -> unsigned char inbuf[8192];
    // -> unsigned int insize;
}

static unsigned long crc$132; // size: 0x4, address: 0x46A8
// Range: 0x9B60 -> 0x9BBC
unsigned long updcrc(unsigned char * s /* r3 */, unsigned int n /* r4 */) {
    // Local variables
    unsigned long c; // r5

    // References
    // -> static unsigned long crc$132;
    // -> static unsigned long crc_32_tab[256];
}

unsigned int outcnt; // size: 0x4, address: 0xAE28
long bytes_in; // size: 0x4, address: 0xAE2C
long bytes_out; // size: 0x4, address: 0xAE30
// Range: 0x9BBC -> 0x9BE0
void clear_bufs() {
    // References
    // -> long bytes_out;
    // -> long bytes_in;
    // -> unsigned int inptr;
    // -> unsigned int insize;
    // -> unsigned int outcnt;
}

// Range: 0x9BE0 -> 0x9CDC
int fill_inbuf(int eof_ok /* r29 */) {
    // Local variables
    int len; // r1+0x8

    // References
    // -> unsigned char inbuf[8192];
    // -> unsigned int inptr;
    // -> struct [anonymous] ifd;
    // -> long bytes_in;
    // -> unsigned int insize;
}

unsigned char window[32768]; // size: 0x8000, address: 0xAE34
// Range: 0x9CDC -> 0x9DBC
void flush_window() {
    // References
    // -> unsigned int outcnt;
    // -> struct [anonymous] ifd;
    // -> long bytes_out;
    // -> struct [anonymous] ofd;
    // -> unsigned char window[32768];
    // -> static unsigned long crc$132;
    // -> static unsigned long crc_32_tab[256];
}

unsigned char outbuf[8192]; // size: 0x2000, address: 0x12E34

